### XmlWinEventLog

[XmlWinEventLog:Security]
KV_MODE = none
EXTRACT-dest = <Data Name='TargetServerName'>(?<dest>[^<]+)<\/Data>
EXTRACT-dest_01 = <Data Name='DestAddress'>(?<dest>[^<]+)<\/Data>
# Set Computer as last dest
EXTRACT-dest_02 = <Computer>(?<dest>[^<]+)<\/Computer>
EXTRACT-dest_nt_domain = <Data Name='TargetDomainName'>(?<dest_nt_domain>[^<]+)</Data>
EXTRACT-dest_port = <Data Name='DestPort'>(?<dest_port>[^<]+)</Data>
EXTRACT-event_id = <EventID>(?<event_id>\d+)<\/EventID>
EXTRACT-event_record_id = <EventRecordID>(?<event_record_id>\d+)<\/EventRecordID>
EXTRACT-logon_type = <Data Name='LogonType'>(?<logon_type>\d+)</Data>
EXTRACT-process = <Data Name='ProcessName'>(?<process>[^<]+)</Data>
EXTRACT-process_id = <Execution ProcessID='(?<process_id>\d+)'
EXTRACT-src = <Data Name='IpAddress'>(?<src>[^<]+)</Data>
EXTRACT-src_01 = <Data Name='SourceAddress'>(?<src>[^<]+)</Data>
EXTRACT-src_nt_domain = <Data Name='SubjectDomainName'>(?<src_nt_domain>[^<]+)</Data>
EXTRACT-src_port = <Data Name='SourcePort'>(?<src_port>[^<]+)</Data>
EXTRACT-src_user = <Data Name='SubjectUserName'>(?<src_user>[^<]+)<\/Data>
EXTRACT-signature_id = <EventID>(?<signature_id>\d+)<\/EventID>
EXTRACT-signature_sub_id = <Data Name='Status'>(?<signature_sub_id>[^<]+)<\/Data>
EXTRACT-thread_id = <Execution ProcessID='\d+' ThreadID='(?<thread_id>\d+)'
EXTRACT-user = <Data Name='TargetUserName'>(?<user>[^<]+)<\/Data>
FIELDALIAS-dvc = host as dvc, host as dvc_nt_host
LOOKUP-wineventlog_security_signature_id_action = wineventlog_security_signature_id_action signature_id OUTPUTNEW action, category, subcategory, signature
LOOKUP-wineventlog_security_signature_sub_id = wineventlog_security_signature_sub_id signature_id signature_sub_id OUTPUTNEW signature_sub
LOOKUP-wineventlog_sourcetype_vendor_product = wineventlog_sourcetype_vendor_product sourcetype OUTPUT vendor, product
LOOKUP-wineventlog_app-event_id = wineventlog_app event_id OUTPUTNEW app
LOOKUP-wineventlog_app-src = wineventlog_app src OUTPUTNEW app
LOOKUP-wineventlog_app-logon_type = wineventlog_app logon_type OUTPUTNEW logon_type_description app

[XmlWinEventLog:System]
KV_MODE = none
EXTRACT-event_id = <EventID>(?<event_id>\d+)<\/EventID>
EXTRACT-event_record_id = <EventRecordID>(?<event_record_id>\d+)<\/EventRecordID>
EXTRACT-event_source = EventSourceName='(?<event_source>[^']+)'
EXTRACT-guid = Guid='(?<guid>[^']+)'
EXTRACT-provider = <Provider Name='(?<provider>[^']+)'
EXTRACT-vendor_severity_id = <Level>(?<vendor_severity_id>\d+)<\/Level>
REPORT-signature,signature_id = xmleventlog_updatelist,xmleventlog_signature_signature_id
FIELDALIAS-dvc = host as dvc, host as dvc_nt_host
LOOKUP-wineventlog_sourcetype_vendor_product = wineventlog_sourcetype_vendor_product sourcetype OUTPUT vendor, product
LOOKUP-wineventlog_vendor_severity_id = wineventlog_vendor_severity_id vendor_severity_id OUTPUT vendor_severity

[XmlWinEventLog:Application]
KV_MODE = none
EXTRACT-event_id = <EventID(?: Qualifiers='\d+')?>(?<event_id>\d+)<\/EventID>
EXTRACT-event_record_id = <EventRecordID>(?<event_record_id>\d+)<\/EventRecordID>
EXTRACT-event_source = EventSourceName='(?<event_source>[^']+)'
EXTRACT-guid = Guid='(?<guid>[^']+)'
EXTRACT-provider = <Provider Name='(?<provider>[^']+)'
FIELDALIAS-dvc = host as dvc, host as dvc_nt_host
LOOKUP-wineventlog_sourcetype_vendor_product = wineventlog_sourcetype_vendor_product sourcetype OUTPUT vendor, product
LOOKUP-wineventlog_vendor_severity_id = wineventlog_vendor_severity_id vendor_severity_id OUTPUT vendor_severity

### WinEventLog

[source::WinEventLog...]
# Disable unneeded $SPLUNK_HOME/etc/default/props.conf report
REPORT-MESSAGE = 

[WinEventLog:Security]
KV_MODE = none
EXTRACT-dest = (?s)Network Information:.*?Destination Address:\s+(?<dest>\S+).*?(?:(?:\r*\n){2})
# Set ComputerName as last dest
EXTRACT-dest_01 = ComputerName=(?<dest>\S+)
EXTRACT-dest_port = (?s)Network Information:.*?Destination Port:\s+(?<dest_port>\S+).*?(?:(?:\r*\n){2})
EXTRACT-dest_nt_domain = (?s)Account Whose Credentials Were Used:.*?Account Domain:\s+(?<dest_nt_domain>\S+).*?(?:(?:\r*\n){2})
EXTRACT-event_id = EventCode=(?<event_id>\d+)
EXTRACT-event_record_id = RecordNumber=(?<event_record_id>\d+)
EXTRACT-logon_type = Logon Type:\s+(?<logon_type>\d+)
EXTRACT-process = (?s)Application Information:.*?Process Name:\s+(?<process>\S+).*?(?:(?:\r*\n){2})
EXTRACT-process_id = (?s)Application Information:.*?Process ID:\s+(?<process_id>\S+).*?(?:(?:\r*\n){2})
EXTRACT-process_id_01 = (?s)Process Information:.*?Process ID:\s+(?<process_id>\S+).*?(?:(?:\r*\n){2})
EXTRACT-signature_id = EventCode=(?<signature_id>\d+)
EXTRACT-signature_sub_id = (?s)Failure Information:.*?Sub Status:\s+(?<signature_sub_id>\S+).*?(?:(?:\r*\n){2})
EXTRACT-src = (?s)Network Information:.*?Source Address:\s+(?<src>\S+).*?(?:(?:\r*\n){2})
EXTRACT-src_nt_domain =(?s)Subject:.*?Account Domain:\s+(?<src_nt_domain>\S+).*?(?:(?:\r*\n){2})
EXTRACT-src_port = (?s)Network Information:.*?Source Port:\s+(?<src_port>\S+).*?(?:(?:\r*\n){2})
EXTRACT-src_user = (?s)Subject:.*?Account Name:\s+(?<src_user>\S+).*?(?:(?:\r*\n){2})
EXTRACT-user = (?s)Account Whose Credentials Were Used:.*?Account Name:\s+(?<user>\S+).*?(?:(?:\r*\n){2})
EXTRACT-vendor_direction = (?s)Network Information:.*?Direction:\s+(?<vendor_direction>\S+).*?(?:(?:\r*\n){2})
FIELDALIAS-dvc = host as dvc, host as dvc_nt_host
LOOKUP-wineventlog_security_signature_id_action = wineventlog_security_signature_id_action signature_id OUTPUTNEW action, category, subcategory, signature
LOOKUP-wineventlog_security_signature_sub_id = wineventlog_security_signature_sub_id signature_id signature_sub_id OUTPUTNEW signature_sub
LOOKUP-wineventlog_sourcetype_vendor_product = wineventlog_sourcetype_vendor_product sourcetype OUTPUT vendor, product
LOOKUP-wineventlog_app-event_id = wineventlog_app event_id OUTPUTNEW app
LOOKUP-wineventlog_app-src = wineventlog_app src OUTPUTNEW app
LOOKUP-wineventlog_app-logon_type = wineventlog_app logon_type OUTPUTNEW logon_type_description app

[WinEventLog:System]
KV_MODE = none
EXTRACT-event_id = EventCode=(?<event_id>\d+)
EXTRACT-event_record_id = RecordNumber=(?<event_record_id>\d+)
EXTRACT-event_source = SourceName=(?<event_source>\S+)
FIELDALIAS-dvc = host as dvc, host as dvc_nt_host
LOOKUP-wineventlog_sourcetype_vendor_product = wineventlog_sourcetype_vendor_product sourcetype OUTPUT vendor, product
LOOKUP-wineventlog_vendor_severity_id = wineventlog_vendor_severity_id vendor_severity_id OUTPUT vendor_severity

[WinEventLog:Application]
KV_MODE = none
EXTRACT-event_id = EventCode=(?<event_id>\d+)
EXTRACT-event_record_id = RecordNumber=(?<event_record_id>\d+)
EXTRACT-event_source = SourceName=(?<event_source>\S+)
FIELDALIAS-dvc = host as dvc, host as dvc_nt_host
LOOKUP-wineventlog_sourcetype_vendor_product = wineventlog_sourcetype_vendor_product sourcetype OUTPUT vendor, product
LOOKUP-wineventlog_vendor_severity_id = wineventlog_vendor_severity_id vendor_severity_id OUTPUT vendor_severity

### Perfmon

[Perfmon:CPU]
FIELDALIAS-dest_for_perfmon = host as dest
FIELDALIAS-src_for_perfmon = host as src
EVAL-cpu_load_mhz = if(counter=="Processor Frequency",Value,null())
EVAL-cpu_load_percent = if(counter=="% Processor Time" AND instance=="_Total",Value,null())
EVAL-cpu_user_percent = if(counter=="% User Time" AND instance=="_Total",Value,null())
EVAL-cpu_interrupts = if(counter=="Interrupts/sec" AND instance=="_Total",Value,null())

[Perfmon:CPUTime]
FIELDALIAS-dest_for_perfmon = host as dest
FIELDALIAS-src_for_perfmon = host as src
EVAL-cpu_load_mhz = if(counter=="Processor Frequency",Value,null())
EVAL-cpu_load_percent = if(counter=="% Processor Time",Value,null())
EVAL-cpu_user_percent = if(counter=="% User Time",Value,null())
EVAL-cpu_interrupts = if(counter=="Interrupts/sec",Value,null())

[Perfmon:System]
FIELDALIAS-dest_for_perfmon = host as dest
FIELDALIAS-src_for_perfmon = host as src
EVAL-wait_threads_count = if(counter=="Processor Queue Length",Value,null())
EVAL-system_threads_count = if(counter=="Threads",Value,null())

[Perfmon:FreeDiskSpace]
FIELDALIAS-dest_for_perfmon = host as dest
FIELDALIAS-src_for_perfmon = host as src
FIELDALIAS-mount_for_perfmon_freediskspace = instance as mount
EVAL-storage_free = if(counter=="Free Megabytes",Value*1048576,null())
EVAL-storage_free_percent = if(counter=="% Free Space",Value,null())
EVAL-storage_used_percent = if(counter=="% Free Space",100-Value,null())

[Perfmon:LogicalDisk]
FIELDALIAS-dest_for_perfmon = host as dest
FIELDALIAS-src_for_perfmon = host as src
EVAL-mount = if(instance=="_Total", null(), instance)
# Keeping this field in ms
EVAL-latency = if(counter=="Avg. Disk sec/Transfer",Value*1000,null())
EVAL-read_latency = if(counter=="Avg. Disk sec/Read",Value,null())
EVAL-write_latency = if(counter=="Avg. Disk sec/Write",Value,null())
EVAL-storage_free_percent = if(counter=="% Free Space",Value,null())
EVAL-read_ops = if(counter=="Disk Reads/sec",Value,null())
EVAL-write_ops = if(counter=="Disk Writes/sec",Value,null())
EVAL-total_ops = if(counter=="Disk Transfers/sec",Value,null())

[Perfmon:LocalNetwork]
FIELDALIAS-dest_for_perfmon = host as dest
FIELDALIAS-src_for_perfmon = host as src
EVAL-thruput = if(counter=="Bytes Total/sec",Value,null())
EVAL-thruput_max = if(counter=="Current Bandwidth",Value,null())

[Perfmon:Process]
FIELDALIAS-dest_for_perfmon = host as dest
FIELDALIAS-src_for_perfmon = host as src
EVAL-process_name = if(instance!="_Total" AND instance!="Idle",instance,null())
EVAL-process_cpu_used_percent = if(instance!="_Total" AND instance!="Idle" AND counter=="% Processor Time", Value, null())
EVAL-process_mem_used = if(instance!="_Total" AND instance!="Idle" AND counter=="Working Set - Private", Value, null())

[Perfmon:Memory]
FIELDALIAS-dest_for_perfmon = host as dest
FIELDALIAS-src_for_perfmon = host as src
EVAL-mem_committed = if(counter=="Committed Bytes",Value,null())
EVAL-mem_free = case(counter=="Available MBytes",Value,counter=="Available Bytes",Value/1048576,1=1,null())
EVAL-swap_free = if(counter=="Pool Nonpaged Bytes",Value,null())
EVAL-swap_used = if(counter=="Pool Paged Bytes",Value,null())
EVAL-mem_page_ops = if(counter=="Pages/sec",Value,null())

### WinHostMon

[WinHostMon]
EVAL-mem_free_percent = if(Type=="OperatingSystem", if(isNull(TotalPhysicalMemoryKB), null(), if(isNull(FreePhysicalMemoryKB), null(), FreePhysicalMemoryKB/TotalPhysicalMemoryKB * 100)), null())
EVAL-mem_used = if(Type=="OperatingSystem", if(isNull(TotalPhysicalMemoryKB), null(), if(isNull(FreePhysicalMemoryKB), null(), (TotalPhysicalMemoryKB - FreePhysicalMemoryKB)/1024)), null())
EVAL-family = if(Type=="OperatingSystem", OS, null())
EVAL-version = if(Type=="OperatingSystem", Version, null())
EVAL-cpu_cores = if(Type=="Processor", NumberOfCores, null())
EVAL-cpu_count = if(Type=="Processor", NumberOfProcessors, null())
EVAL-cpu_mhz = if(Type=="Processor", ClockSpeedMHz, null())
EVAL-mem = if(Type=="OperatingSystem", TotalPhysicalMemoryKB/1024, null())
EVAL-vendor_product = if(Type=="OperatingSystem", OS, null())
EVAL-mount = if (Type=="Disk", Name, null())
EVAL-storage = if (Type=="Disk", TotalSpaceKB/1024, null())
EVAL-storage_free = if (Type=="Disk", FreeSpaceKB/1024, null())
EVAL-storage_used = if (Type=="Disk", (TotalSpaceKB-FreeSpaceKB)/1024, null())

### Script:InstalledApps

[Script:InstalledApps]
SHOULD_LINEMERGE = true
LINE_BREAKER  =

### WindowsUpdateLog

[WindowsUpdateLog]
KV_MODE = none
FIELDALIAS-dest_for_windowsupdate = host as dest
EXTRACT-signature = Windows successfully installed the following update:\s+(?<signature>.*?(?<signature_id>KB\d+)[^$]+)
EXTRACT-component = ^\S+\s+\S+\s+\S+\s+\S+\s+(?<component>\S+)
EXTRACT-process_id = ^\S+\s+\S+\s+(?<process_id>\S+)
EXTRACT-thread_id = ^\S+\s+\S+\s+\d+\s+(?<thread_id>\S+)
EXTRACT-vendor_status = (?<vendor_status>(?:Installation\s+successful\s+and\s+restart\s+required|Installation\s+(Successful|Failure)|Restart\s+Required|Installation\s+Ready))
REPORT-signature_signature_id = windowsupdatelog_signature_message,windowsupdatelog_signature_signature_id
LOOKUP-windowsupdatelog_status = windowsupdatelog_status vendor_status OUTPUT status

### DHCP

[DhcpSrvLog]
SHOULD_LINEMERGE = false
KV_MODE = none
TRANSFORMS-dhcp_discard_headers = dhcpsrvlog_discard_headers
EXTRACT-msdhcp_id,description,dest_ip,dest_nt_host,dest_mac = (?<msdhcp_id>[^,]+),[^,]+,[^,]+,(?<description>[^,]?),(?<dest_ip>[^,]+),(?<dest_nt_host>[^,]+),(?<dest_mac>[^$]+)
REPORT-dest = dchpsrvlog_dest_nt_host_as_dest,dchpsrvlog_dest_mac_as_dest,dchpsrvlog_dest_ip_as_dest
LOOKUP-dhcpsrvlog_msdhcp_id_signature = dhcpsrvlog_msdhcp_id_signature msdhcp_id OUTPUT signature

### WinRegistry

[WinRegistry]
KV_MODE = none
EXTRACT-object_path = key_path="(?<object_path>[^"]+)"
EXTRACT-object = (?s)key_path="(\\[^\n]+)*\\(?<object>[^"]+)".*?data_type
EXTRACT-user = (?s)process_image="(\\[^\n]+)*\\(?<user>[^"]+)".*?registry_type
EXTRACT-vendor_action = registry_type="(?<vendor_action>[^"]+)"
EXTRACT-vendor_status,msg = event_status="\((?<vendor_status>[0-9-]+)\)(?<msg>[^\"]+)"
LOOKUP-windows_object_category = windows_object_category object as sourcetype OUTPUT object_category
LOOKUP-windows_status = windows_status vendor_status OUTPUT status
FIELDALIAS-dest = host as dest
