[XmlWinEventLog:Security]
KV_MODE = none
EXTRACT-dest = <Data Name='TargetServerName'>(?<dest>[^<]+)<\/Data>
EXTRACT-dest_01 = <Data Name='DestAddress'>(?<dest>[^<]+)<\/Data>
# Set Computer as last dest
EXTRACT-dest_02 = <Computer>(?<dest>[^<]+)<\/Computer>
EXTRACT-dest_nt_domain = <Data Name='TargetDomainName'>(?<dest_nt_domain>[^<]+)</Data>
EXTRACT-dest_port = <Data Name='DestPort'>(?<dest_port>[^<]+)</Data>
EXTRACT-event_id = <EventID>(?<event_id>\d+)<\/EventID>
EXTRACT-event_record_id = <EventRecordID>(?<event_record_id>\d+)<\/EventRecordID>
EXTRACT-logon_type = <Data Name='LogonType'>(?<logon_type>\d+)</Data>
EXTRACT-process = <Data Name='ProcessName'>(?<process>[^<]+)</Data>
EXTRACT-process_id = <Execution ProcessID='(?<process_id>\d+)'
EXTRACT-src = <Data Name='IpAddress'>(?<src>[^<]+)</Data>
EXTRACT-src_01 = <Data Name='SourceAddress'>(?<src>[^<]+)</Data>
EXTRACT-src_nt_domain = <Data Name='SubjectDomainName'>(?<src_nt_domain>[^<]+)</Data>
EXTRACT-src_port = <Data Name='SourcePort'>(?<src_port>[^<]+)</Data>
EXTRACT-src_user = <Data Name='SubjectUserName'>(?<src_user>[^<]+)<\/Data>
EXTRACT-signature_id = <EventID>(?<signature_id>\d+)<\/EventID>
EXTRACT-signature_sub_id = <Data Name='Status'>(?<signature_sub_id>[^<]+)<\/Data>
EXTRACT-thread_id = <Execution ProcessID='\d+' ThreadID='(?<thread_id>\d+)'
EXTRACT-user = <Data Name='TargetUserName'>(?<user>[^<]+)<\/Data>
FIELDALIAS-dvc = host as dvc, host as dvc_nt_host
LOOKUP-wineventlog_security_signature_id_action = wineventlog_security_signature_id_action signature_id OUTPUTNEW action, category, subcategory, signature
LOOKUP-wineventlog_security_signature_sub_id = wineventlog_security_signature_sub_id signature_id signature_sub_id OUTPUTNEW signature_sub
LOOKUP-wineventlog_sourcetype_vendor_product = wineventlog_sourcetype_vendor_product sourcetype OUTPUT vendor, product
LOOKUP-wineventlog_app-event_id = wineventlog_app event_id OUTPUTNEW app
LOOKUP-wineventlog_app-src = wineventlog_app src OUTPUTNEW app
LOOKUP-wineventlog_app-logon_type = wineventlog_app logon_type OUTPUTNEW logon_type_description app

[XmlWinEventLog:System]
KV_MODE = none
EXTRACT-event_id = <EventID>(?<event_id>\d+)<\/EventID>
EXTRACT-event_record_id = <EventRecordID>(?<event_record_id>\d+)<\/EventRecordID>
EXTRACT-event_source = EventSourceName='(?<event_source>[^']+)'
EXTRACT-guid = Guid='(?<guid>[^']+)'
EXTRACT-provider = <Provider Name='(?<provider>[^']+)'
EXTRACT-vendor_severity_id = <Level>(?<vendor_severity_id>\d+)<\/Level>
FIELDALIAS-dvc = host as dvc, host as dvc_nt_host
LOOKUP-wineventlog_sourcetype_vendor_product = wineventlog_sourcetype_vendor_product sourcetype OUTPUT vendor, product
LOOKUP-wineventlog_vendor_severity_id = wineventlog_vendor_severity_id vendor_severity_id OUTPUT vendor_severity

[XmlWinEventLog:Application]
KV_MODE = none
EXTRACT-event_id = <EventID(?: Qualifiers='\d+')?>(?<event_id>\d+)<\/EventID>
EXTRACT-event_record_id = <EventRecordID>(?<event_record_id>\d+)<\/EventRecordID>
EXTRACT-event_source = EventSourceName='(?<event_source>[^']+)'
EXTRACT-guid = Guid='(?<guid>[^']+)'
EXTRACT-provider = <Provider Name='(?<provider>[^']+)'
FIELDALIAS-dvc = host as dvc, host as dvc_nt_host
LOOKUP-wineventlog_sourcetype_vendor_product = wineventlog_sourcetype_vendor_product sourcetype OUTPUT vendor, product
LOOKUP-wineventlog_vendor_severity_id = wineventlog_vendor_severity_id vendor_severity_id OUTPUT vendor_severity

[source::WinEventLog...]
# Disable unneeded $SPLUNK_HOME/etc/default/props.conf report
REPORT-MESSAGE = 

[WinEventLog:Security]
KV_MODE = none
EXTRACT-dest = (?s)Network Information:.*?Destination Address:\s+(?<dest>\S+).*?(?:(?:\r*\n){2})
# Set ComputerName as last dest
EXTRACT-dest_01 = ComputerName=(?<dest>\S+)
EXTRACT-dest_port = (?s)Network Information:.*?Destination Port:\s+(?<dest_port>\S+).*?(?:(?:\r*\n){2})
EXTRACT-dest_nt_domain = (?s)Account Whose Credentials Were Used:.*?Account Domain:\s+(?<dest_nt_domain>\S+).*?(?:(?:\r*\n){2})
EXTRACT-event_id = EventCode=(?<event_id>\d+)
EXTRACT-event_record_id = RecordNumber=(?<event_record_id>\d+)
EXTRACT-logon_type = Logon Type:\s+(?<logon_type>\d+)
EXTRACT-process = (?s)Application Information:.*?Process Name:\s+(?<process>\S+).*?(?:(?:\r*\n){2})
EXTRACT-process_id = (?s)Application Information:.*?Process ID:\s+(?<process_id>\S+).*?(?:(?:\r*\n){2})
EXTRACT-process_id_01 = (?s)Process Information:.*?Process ID:\s+(?<process_id>\S+).*?(?:(?:\r*\n){2})
EXTRACT-signature_id = EventCode=(?<signature_id>\d+)
EXTRACT-signature_sub_id = (?s)Failure Information:.*?Sub Status:\s+(?<signature_sub_id>\S+).*?(?:(?:\r*\n){2})
EXTRACT-src = (?s)Network Information:.*?Source Address:\s+(?<src>\S+).*?(?:(?:\r*\n){2})
EXTRACT-src_port = (?s)Network Information:.*?Source Port:\s+(?<src_port>\S+).*?(?:(?:\r*\n){2})
EXTRACT-src_nt_domain =(?s)Subject:.*?Account Domain:\s+(?<src_nt_domain>\S+).*?(?:(?:\r*\n){2})
EXTRACT-src_user = (?s)Subject:.*?Account Name:\s+(?<src_user>\S+).*?(?:(?:\r*\n){2})
EXTRACT-user = (?s)Account Whose Credentials Were Used:.*?Account Name:\s+(?<user>\S+).*?(?:(?:\r*\n){2})
EXTRACT-vendor_direction = (?s)Network Information:.*?Direction:\s+(?<vendor_direction>\S+).*?(?:(?:\r*\n){2})
FIELDALIAS-dvc = host as dvc, host as dvc_nt_host
LOOKUP-wineventlog_security_signature_id_action = wineventlog_security_signature_id_action signature_id OUTPUTNEW action, category, subcategory, signature
LOOKUP-wineventlog_security_signature_sub_id = wineventlog_security_signature_sub_id signature_id signature_sub_id OUTPUTNEW signature_sub
LOOKUP-wineventlog_sourcetype_vendor_product = wineventlog_sourcetype_vendor_product sourcetype OUTPUT vendor, product
LOOKUP-wineventlog_app-event_id = wineventlog_app event_id OUTPUTNEW app
LOOKUP-wineventlog_app-src = wineventlog_app src OUTPUTNEW app
LOOKUP-wineventlog_app-logon_type = wineventlog_app logon_type OUTPUTNEW logon_type_description app

[WinEventLog:System]
KV_MODE = none
EXTRACT-event_id = EventCode=(?<event_id>\d+)
FIELDALIAS-dvc = host as dvc, host as dvc_nt_host

[WinEventLog:Application]
KV_MODE = none
EXTRACT-event_id = EventCode=(?<event_id>\d+)
FIELDALIAS-dvc = host as dvc, host as dvc_nt_host
